; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p12---int100n150-m25---int100c110---s488---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level12 level12)
(sum level0 level13 level13)
(sum level0 level17 level17)
(sum level0 level18 level18)
(sum level0 level19 level19)
(sum level0 level22 level22)
(sum level1 level4 level5)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level12 level13)
(sum level1 level13 level14)
(sum level1 level17 level18)
(sum level1 level18 level19)
(sum level1 level19 level20)
(sum level1 level22 level23)
(sum level2 level4 level6)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level12 level14)
(sum level2 level13 level15)
(sum level2 level17 level19)
(sum level2 level18 level20)
(sum level2 level19 level21)
(sum level2 level22 level24)
(sum level3 level4 level7)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level12 level15)
(sum level3 level13 level16)
(sum level3 level17 level20)
(sum level3 level18 level21)
(sum level3 level19 level22)
(sum level3 level22 level25)
(sum level4 level4 level8)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level12 level16)
(sum level4 level13 level17)
(sum level4 level17 level21)
(sum level4 level18 level22)
(sum level4 level19 level23)
(sum level4 level22 level26)
(sum level5 level4 level9)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level12 level17)
(sum level5 level13 level18)
(sum level5 level17 level22)
(sum level5 level18 level23)
(sum level5 level19 level24)
(sum level5 level22 level27)
(sum level6 level4 level10)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level12 level18)
(sum level6 level13 level19)
(sum level6 level17 level23)
(sum level6 level18 level24)
(sum level6 level19 level25)
(sum level6 level22 level28)
(sum level7 level4 level11)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level12 level19)
(sum level7 level13 level20)
(sum level7 level17 level24)
(sum level7 level18 level25)
(sum level7 level19 level26)
(sum level7 level22 level29)
(sum level8 level4 level12)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level12 level20)
(sum level8 level13 level21)
(sum level8 level17 level25)
(sum level8 level18 level26)
(sum level8 level19 level27)
(sum level8 level22 level30)
(sum level9 level4 level13)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level12 level21)
(sum level9 level13 level22)
(sum level9 level17 level26)
(sum level9 level18 level27)
(sum level9 level19 level28)
(sum level9 level22 level31)
(sum level10 level4 level14)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level12 level22)
(sum level10 level13 level23)
(sum level10 level17 level27)
(sum level10 level18 level28)
(sum level10 level19 level29)
(sum level10 level22 level32)
(sum level11 level4 level15)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level12 level23)
(sum level11 level13 level24)
(sum level11 level17 level28)
(sum level11 level18 level29)
(sum level11 level19 level30)
(sum level11 level22 level33)
(sum level12 level4 level16)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level12 level24)
(sum level12 level13 level25)
(sum level12 level17 level29)
(sum level12 level18 level30)
(sum level12 level19 level31)
(sum level12 level22 level34)
(sum level13 level4 level17)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level12 level25)
(sum level13 level13 level26)
(sum level13 level17 level30)
(sum level13 level18 level31)
(sum level13 level19 level32)
(sum level13 level22 level35)
(sum level14 level4 level18)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level12 level26)
(sum level14 level13 level27)
(sum level14 level17 level31)
(sum level14 level18 level32)
(sum level14 level19 level33)
(sum level14 level22 level36)
(sum level15 level4 level19)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level12 level27)
(sum level15 level13 level28)
(sum level15 level17 level32)
(sum level15 level18 level33)
(sum level15 level19 level34)
(sum level15 level22 level37)
(sum level16 level4 level20)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level12 level28)
(sum level16 level13 level29)
(sum level16 level17 level33)
(sum level16 level18 level34)
(sum level16 level19 level35)
(sum level16 level22 level38)
(sum level17 level4 level21)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level12 level29)
(sum level17 level13 level30)
(sum level17 level17 level34)
(sum level17 level18 level35)
(sum level17 level19 level36)
(sum level17 level22 level39)
(sum level18 level4 level22)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level12 level30)
(sum level18 level13 level31)
(sum level18 level17 level35)
(sum level18 level18 level36)
(sum level18 level19 level37)
(sum level18 level22 level40)
(sum level19 level4 level23)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level12 level31)
(sum level19 level13 level32)
(sum level19 level17 level36)
(sum level19 level18 level37)
(sum level19 level19 level38)
(sum level19 level22 level41)
(sum level20 level4 level24)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level12 level32)
(sum level20 level13 level33)
(sum level20 level17 level37)
(sum level20 level18 level38)
(sum level20 level19 level39)
(sum level20 level22 level42)
(sum level21 level4 level25)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level12 level33)
(sum level21 level13 level34)
(sum level21 level17 level38)
(sum level21 level18 level39)
(sum level21 level19 level40)
(sum level21 level22 level43)
(sum level22 level4 level26)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level12 level34)
(sum level22 level13 level35)
(sum level22 level17 level39)
(sum level22 level18 level40)
(sum level22 level19 level41)
(sum level22 level22 level44)
(sum level23 level4 level27)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level12 level35)
(sum level23 level13 level36)
(sum level23 level17 level40)
(sum level23 level18 level41)
(sum level23 level19 level42)
(sum level23 level22 level45)
(sum level24 level4 level28)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level12 level36)
(sum level24 level13 level37)
(sum level24 level17 level41)
(sum level24 level18 level42)
(sum level24 level19 level43)
(sum level24 level22 level46)
(sum level25 level4 level29)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level12 level37)
(sum level25 level13 level38)
(sum level25 level17 level42)
(sum level25 level18 level43)
(sum level25 level19 level44)
(sum level25 level22 level47)
(sum level26 level4 level30)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level12 level38)
(sum level26 level13 level39)
(sum level26 level17 level43)
(sum level26 level18 level44)
(sum level26 level19 level45)
(sum level26 level22 level48)
(sum level27 level4 level31)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level12 level39)
(sum level27 level13 level40)
(sum level27 level17 level44)
(sum level27 level18 level45)
(sum level27 level19 level46)
(sum level27 level22 level49)
(sum level28 level4 level32)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level12 level40)
(sum level28 level13 level41)
(sum level28 level17 level45)
(sum level28 level18 level46)
(sum level28 level19 level47)
(sum level28 level22 level50)
(sum level29 level4 level33)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level12 level41)
(sum level29 level13 level42)
(sum level29 level17 level46)
(sum level29 level18 level47)
(sum level29 level19 level48)
(sum level29 level22 level51)
(sum level30 level4 level34)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level12 level42)
(sum level30 level13 level43)
(sum level30 level17 level47)
(sum level30 level18 level48)
(sum level30 level19 level49)
(sum level30 level22 level52)
(sum level31 level4 level35)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level12 level43)
(sum level31 level13 level44)
(sum level31 level17 level48)
(sum level31 level18 level49)
(sum level31 level19 level50)
(sum level31 level22 level53)
(sum level32 level4 level36)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level12 level44)
(sum level32 level13 level45)
(sum level32 level17 level49)
(sum level32 level18 level50)
(sum level32 level19 level51)
(sum level32 level22 level54)
(sum level33 level4 level37)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level12 level45)
(sum level33 level13 level46)
(sum level33 level17 level50)
(sum level33 level18 level51)
(sum level33 level19 level52)
(sum level33 level22 level55)
(sum level34 level4 level38)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level12 level46)
(sum level34 level13 level47)
(sum level34 level17 level51)
(sum level34 level18 level52)
(sum level34 level19 level53)
(sum level34 level22 level56)
(sum level35 level4 level39)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level12 level47)
(sum level35 level13 level48)
(sum level35 level17 level52)
(sum level35 level18 level53)
(sum level35 level19 level54)
(sum level35 level22 level57)
(sum level36 level4 level40)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level12 level48)
(sum level36 level13 level49)
(sum level36 level17 level53)
(sum level36 level18 level54)
(sum level36 level19 level55)
(sum level36 level22 level58)
(sum level37 level4 level41)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level12 level49)
(sum level37 level13 level50)
(sum level37 level17 level54)
(sum level37 level18 level55)
(sum level37 level19 level56)
(sum level37 level22 level59)
(sum level38 level4 level42)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level12 level50)
(sum level38 level13 level51)
(sum level38 level17 level55)
(sum level38 level18 level56)
(sum level38 level19 level57)
(sum level38 level22 level60)
(sum level39 level4 level43)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level12 level51)
(sum level39 level13 level52)
(sum level39 level17 level56)
(sum level39 level18 level57)
(sum level39 level19 level58)
(sum level39 level22 level61)
(sum level40 level4 level44)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level12 level52)
(sum level40 level13 level53)
(sum level40 level17 level57)
(sum level40 level18 level58)
(sum level40 level19 level59)
(sum level40 level22 level62)
(sum level41 level4 level45)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level12 level53)
(sum level41 level13 level54)
(sum level41 level17 level58)
(sum level41 level18 level59)
(sum level41 level19 level60)
(sum level41 level22 level63)
(sum level42 level4 level46)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level12 level54)
(sum level42 level13 level55)
(sum level42 level17 level59)
(sum level42 level18 level60)
(sum level42 level19 level61)
(sum level42 level22 level64)
(sum level43 level4 level47)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level12 level55)
(sum level43 level13 level56)
(sum level43 level17 level60)
(sum level43 level18 level61)
(sum level43 level19 level62)
(sum level43 level22 level65)
(sum level44 level4 level48)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level12 level56)
(sum level44 level13 level57)
(sum level44 level17 level61)
(sum level44 level18 level62)
(sum level44 level19 level63)
(sum level44 level22 level66)
(sum level45 level4 level49)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level12 level57)
(sum level45 level13 level58)
(sum level45 level17 level62)
(sum level45 level18 level63)
(sum level45 level19 level64)
(sum level45 level22 level67)
(sum level46 level4 level50)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level12 level58)
(sum level46 level13 level59)
(sum level46 level17 level63)
(sum level46 level18 level64)
(sum level46 level19 level65)
(sum level46 level22 level68)
(sum level47 level4 level51)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level12 level59)
(sum level47 level13 level60)
(sum level47 level17 level64)
(sum level47 level18 level65)
(sum level47 level19 level66)
(sum level47 level22 level69)
(sum level48 level4 level52)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level12 level60)
(sum level48 level13 level61)
(sum level48 level17 level65)
(sum level48 level18 level66)
(sum level48 level19 level67)
(sum level48 level22 level70)
(sum level49 level4 level53)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level12 level61)
(sum level49 level13 level62)
(sum level49 level17 level66)
(sum level49 level18 level67)
(sum level49 level19 level68)
(sum level49 level22 level71)
(sum level50 level4 level54)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level12 level62)
(sum level50 level13 level63)
(sum level50 level17 level67)
(sum level50 level18 level68)
(sum level50 level19 level69)
(sum level50 level22 level72)
(sum level51 level4 level55)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level12 level63)
(sum level51 level13 level64)
(sum level51 level17 level68)
(sum level51 level18 level69)
(sum level51 level19 level70)
(sum level51 level22 level73)
(sum level52 level4 level56)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level12 level64)
(sum level52 level13 level65)
(sum level52 level17 level69)
(sum level52 level18 level70)
(sum level52 level19 level71)
(sum level52 level22 level74)
(sum level53 level4 level57)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level53 level12 level65)
(sum level53 level13 level66)
(sum level53 level17 level70)
(sum level53 level18 level71)
(sum level53 level19 level72)
(sum level53 level22 level75)
(sum level54 level4 level58)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level54 level12 level66)
(sum level54 level13 level67)
(sum level54 level17 level71)
(sum level54 level18 level72)
(sum level54 level19 level73)
(sum level54 level22 level76)
(sum level55 level4 level59)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level55 level12 level67)
(sum level55 level13 level68)
(sum level55 level17 level72)
(sum level55 level18 level73)
(sum level55 level19 level74)
(sum level55 level22 level77)
(sum level56 level4 level60)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level56 level12 level68)
(sum level56 level13 level69)
(sum level56 level17 level73)
(sum level56 level18 level74)
(sum level56 level19 level75)
(sum level56 level22 level78)
(sum level57 level4 level61)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level57 level12 level69)
(sum level57 level13 level70)
(sum level57 level17 level74)
(sum level57 level18 level75)
(sum level57 level19 level76)
(sum level57 level22 level79)
(sum level58 level4 level62)
(sum level58 level6 level64)
(sum level58 level7 level65)
(sum level58 level12 level70)
(sum level58 level13 level71)
(sum level58 level17 level75)
(sum level58 level18 level76)
(sum level58 level19 level77)
(sum level58 level22 level80)
(sum level59 level4 level63)
(sum level59 level6 level65)
(sum level59 level7 level66)
(sum level59 level12 level71)
(sum level59 level13 level72)
(sum level59 level17 level76)
(sum level59 level18 level77)
(sum level59 level19 level78)
(sum level59 level22 level81)
(sum level60 level4 level64)
(sum level60 level6 level66)
(sum level60 level7 level67)
(sum level60 level12 level72)
(sum level60 level13 level73)
(sum level60 level17 level77)
(sum level60 level18 level78)
(sum level60 level19 level79)
(sum level60 level22 level82)
(sum level61 level4 level65)
(sum level61 level6 level67)
(sum level61 level7 level68)
(sum level61 level12 level73)
(sum level61 level13 level74)
(sum level61 level17 level78)
(sum level61 level18 level79)
(sum level61 level19 level80)
(sum level61 level22 level83)
(sum level62 level4 level66)
(sum level62 level6 level68)
(sum level62 level7 level69)
(sum level62 level12 level74)
(sum level62 level13 level75)
(sum level62 level17 level79)
(sum level62 level18 level80)
(sum level62 level19 level81)
(sum level62 level22 level84)
(sum level63 level4 level67)
(sum level63 level6 level69)
(sum level63 level7 level70)
(sum level63 level12 level75)
(sum level63 level13 level76)
(sum level63 level17 level80)
(sum level63 level18 level81)
(sum level63 level19 level82)
(sum level63 level22 level85)
(sum level64 level4 level68)
(sum level64 level6 level70)
(sum level64 level7 level71)
(sum level64 level12 level76)
(sum level64 level13 level77)
(sum level64 level17 level81)
(sum level64 level18 level82)
(sum level64 level19 level83)
(sum level64 level22 level86)
(sum level65 level4 level69)
(sum level65 level6 level71)
(sum level65 level7 level72)
(sum level65 level12 level77)
(sum level65 level13 level78)
(sum level65 level17 level82)
(sum level65 level18 level83)
(sum level65 level19 level84)
(sum level65 level22 level87)
(sum level66 level4 level70)
(sum level66 level6 level72)
(sum level66 level7 level73)
(sum level66 level12 level78)
(sum level66 level13 level79)
(sum level66 level17 level83)
(sum level66 level18 level84)
(sum level66 level19 level85)
(sum level66 level22 level88)
(sum level67 level4 level71)
(sum level67 level6 level73)
(sum level67 level7 level74)
(sum level67 level12 level79)
(sum level67 level13 level80)
(sum level67 level17 level84)
(sum level67 level18 level85)
(sum level67 level19 level86)
(sum level67 level22 level89)
(sum level68 level4 level72)
(sum level68 level6 level74)
(sum level68 level7 level75)
(sum level68 level12 level80)
(sum level68 level13 level81)
(sum level68 level17 level85)
(sum level68 level18 level86)
(sum level68 level19 level87)
(sum level68 level22 level90)
(sum level69 level4 level73)
(sum level69 level6 level75)
(sum level69 level7 level76)
(sum level69 level12 level81)
(sum level69 level13 level82)
(sum level69 level17 level86)
(sum level69 level18 level87)
(sum level69 level19 level88)
(sum level69 level22 level91)
(sum level70 level4 level74)
(sum level70 level6 level76)
(sum level70 level7 level77)
(sum level70 level12 level82)
(sum level70 level13 level83)
(sum level70 level17 level87)
(sum level70 level18 level88)
(sum level70 level19 level89)
(sum level70 level22 level92)
(sum level71 level4 level75)
(sum level71 level6 level77)
(sum level71 level7 level78)
(sum level71 level12 level83)
(sum level71 level13 level84)
(sum level71 level17 level88)
(sum level71 level18 level89)
(sum level71 level19 level90)
(sum level71 level22 level93)
(sum level72 level4 level76)
(sum level72 level6 level78)
(sum level72 level7 level79)
(sum level72 level12 level84)
(sum level72 level13 level85)
(sum level72 level17 level89)
(sum level72 level18 level90)
(sum level72 level19 level91)
(sum level72 level22 level94)
(sum level73 level4 level77)
(sum level73 level6 level79)
(sum level73 level7 level80)
(sum level73 level12 level85)
(sum level73 level13 level86)
(sum level73 level17 level90)
(sum level73 level18 level91)
(sum level73 level19 level92)
(sum level73 level22 level95)
(sum level74 level4 level78)
(sum level74 level6 level80)
(sum level74 level7 level81)
(sum level74 level12 level86)
(sum level74 level13 level87)
(sum level74 level17 level91)
(sum level74 level18 level92)
(sum level74 level19 level93)
(sum level74 level22 level96)
(sum level75 level4 level79)
(sum level75 level6 level81)
(sum level75 level7 level82)
(sum level75 level12 level87)
(sum level75 level13 level88)
(sum level75 level17 level92)
(sum level75 level18 level93)
(sum level75 level19 level94)
(sum level75 level22 level97)
(sum level76 level4 level80)
(sum level76 level6 level82)
(sum level76 level7 level83)
(sum level76 level12 level88)
(sum level76 level13 level89)
(sum level76 level17 level93)
(sum level76 level18 level94)
(sum level76 level19 level95)
(sum level76 level22 level98)
(sum level77 level4 level81)
(sum level77 level6 level83)
(sum level77 level7 level84)
(sum level77 level12 level89)
(sum level77 level13 level90)
(sum level77 level17 level94)
(sum level77 level18 level95)
(sum level77 level19 level96)
(sum level77 level22 level99)
(sum level78 level4 level82)
(sum level78 level6 level84)
(sum level78 level7 level85)
(sum level78 level12 level90)
(sum level78 level13 level91)
(sum level78 level17 level95)
(sum level78 level18 level96)
(sum level78 level19 level97)
(sum level78 level22 level100)
(sum level79 level4 level83)
(sum level79 level6 level85)
(sum level79 level7 level86)
(sum level79 level12 level91)
(sum level79 level13 level92)
(sum level79 level17 level96)
(sum level79 level18 level97)
(sum level79 level19 level98)
(sum level79 level22 level101)
(sum level80 level4 level84)
(sum level80 level6 level86)
(sum level80 level7 level87)
(sum level80 level12 level92)
(sum level80 level13 level93)
(sum level80 level17 level97)
(sum level80 level18 level98)
(sum level80 level19 level99)
(sum level80 level22 level102)
(sum level81 level4 level85)
(sum level81 level6 level87)
(sum level81 level7 level88)
(sum level81 level12 level93)
(sum level81 level13 level94)
(sum level81 level17 level98)
(sum level81 level18 level99)
(sum level81 level19 level100)
(sum level82 level4 level86)
(sum level82 level6 level88)
(sum level82 level7 level89)
(sum level82 level12 level94)
(sum level82 level13 level95)
(sum level82 level17 level99)
(sum level82 level18 level100)
(sum level82 level19 level101)
(sum level83 level4 level87)
(sum level83 level6 level89)
(sum level83 level7 level90)
(sum level83 level12 level95)
(sum level83 level13 level96)
(sum level83 level17 level100)
(sum level83 level18 level101)
(sum level83 level19 level102)
(sum level84 level4 level88)
(sum level84 level6 level90)
(sum level84 level7 level91)
(sum level84 level12 level96)
(sum level84 level13 level97)
(sum level84 level17 level101)
(sum level84 level18 level102)
(sum level85 level4 level89)
(sum level85 level6 level91)
(sum level85 level7 level92)
(sum level85 level12 level97)
(sum level85 level13 level98)
(sum level85 level17 level102)
(sum level86 level4 level90)
(sum level86 level6 level92)
(sum level86 level7 level93)
(sum level86 level12 level98)
(sum level86 level13 level99)
(sum level87 level4 level91)
(sum level87 level6 level93)
(sum level87 level7 level94)
(sum level87 level12 level99)
(sum level87 level13 level100)
(sum level88 level4 level92)
(sum level88 level6 level94)
(sum level88 level7 level95)
(sum level88 level12 level100)
(sum level88 level13 level101)
(sum level89 level4 level93)
(sum level89 level6 level95)
(sum level89 level7 level96)
(sum level89 level12 level101)
(sum level89 level13 level102)
(sum level90 level4 level94)
(sum level90 level6 level96)
(sum level90 level7 level97)
(sum level90 level12 level102)
(sum level91 level4 level95)
(sum level91 level6 level97)
(sum level91 level7 level98)
(sum level92 level4 level96)
(sum level92 level6 level98)
(sum level92 level7 level99)
(sum level93 level4 level97)
(sum level93 level6 level99)
(sum level93 level7 level100)
(sum level94 level4 level98)
(sum level94 level6 level100)
(sum level94 level7 level101)
(sum level95 level4 level99)
(sum level95 level6 level101)
(sum level95 level7 level102)
(sum level96 level4 level100)
(sum level96 level6 level102)
(sum level97 level4 level101)
(sum level98 level4 level102)

(connected l0 l1)
(fuelcost level13 l0 l1)
(connected l0 l2)
(fuelcost level7 l0 l2)
(connected l0 l4)
(fuelcost level22 l0 l4)
(connected l1 l0)
(fuelcost level13 l1 l0)
(connected l1 l2)
(fuelcost level18 l1 l2)
(connected l1 l4)
(fuelcost level17 l1 l4)
(connected l1 l5)
(fuelcost level18 l1 l5)
(connected l2 l0)
(fuelcost level7 l2 l0)
(connected l2 l1)
(fuelcost level18 l2 l1)
(connected l3 l4)
(fuelcost level19 l3 l4)
(connected l3 l6)
(fuelcost level12 l3 l6)
(connected l4 l0)
(fuelcost level22 l4 l0)
(connected l4 l1)
(fuelcost level17 l4 l1)
(connected l4 l3)
(fuelcost level19 l4 l3)
(connected l4 l5)
(fuelcost level4 l4 l5)
(connected l4 l6)
(fuelcost level6 l4 l6)
(connected l5 l1)
(fuelcost level18 l5 l1)
(connected l5 l4)
(fuelcost level4 l5 l4)
(connected l6 l3)
(fuelcost level12 l6 l3)
(connected l6 l4)
(fuelcost level6 l6 l4)

(at t0 l3)
(fuel t0 level102)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l1)
(at p3 l3)
(at p4 l6)
(at p5 l0)
(at p6 l3)
(at p7 l5)
(at p8 l4)
(at p9 l6)
(at p10 l3)
(at p11 l3)
)

(:goal
(and
(at p0 l5)
(at p1 l3)
(at p2 l3)
(at p3 l6)
(at p4 l3)
(at p5 l3)
(at p6 l4)
(at p7 l6)
(at p8 l3)
(at p9 l4)
(at p10 l5)
(at p11 l5)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 0 of 12
2. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 0 of 12
3. (load p11 t0 l3)
   deleted: (at p11 l3)
   added: (in p11 t0)
   goals met: 0 of 12
4. (load p10 t0 l3)
   deleted: (at p10 l3)
   added: (in p10 t0)
   goals met: 0 of 12
5. (drive t0 l3 l6 level90 level12 level102)
   deleted: (at t0 l3) (fuel t0 level102)
   added: (at t0 l6) (fuel t0 level90)
   goals met: 0 of 12
6. (load p9 t0 l6)
   deleted: (at p9 l6)
   added: (in p9 t0)
   goals met: 0 of 12
7. (load p4 t0 l6)
   deleted: (at p4 l6)
   added: (in p4 t0)
   goals met: 0 of 12
8. (drive t0 l6 l4 level84 level6 level90)
   deleted: (at t0 l6) (fuel t0 level90)
   added: (at t0 l4) (fuel t0 level84)
   goals met: 0 of 12
9. (drive t0 l4 l0 level62 level22 level84)
   deleted: (at t0 l4) (fuel t0 level84)
   added: (at t0 l0) (fuel t0 level62)
   goals met: 0 of 12
10. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 12
11. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 12
12. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 12
13. (drive t0 l0 l1 level49 level13 level62)
   deleted: (at t0 l0) (fuel t0 level62)
   added: (at t0 l1) (fuel t0 level49)
   goals met: 0 of 12
14. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 12
15. (drive t0 l1 l5 level31 level18 level49)
   deleted: (at t0 l1) (fuel t0 level49)
   added: (at t0 l5) (fuel t0 level31)
   goals met: 0 of 12
16. (load p7 t0 l5)
   deleted: (at p7 l5)
   added: (in p7 t0)
   goals met: 0 of 12
17. (unload p0 t0 l5)
   deleted: (in p0 t0)
   added: (at p0 l5)
   goals met: 1 of 12
18. (unload p10 t0 l5)
   deleted: (in p10 t0)
   added: (at p10 l5)
   goals met: 2 of 12
19. (unload p11 t0 l5)
   deleted: (in p11 t0)
   added: (at p11 l5)
   goals met: 3 of 12
20. (drive t0 l5 l4 level27 level4 level31)
   deleted: (at t0 l5) (fuel t0 level31)
   added: (at t0 l4) (fuel t0 level27)
   goals met: 3 of 12
21. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 3 of 12
22. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 4 of 12
23. (unload p9 t0 l4)
   deleted: (in p9 t0)
   added: (at p9 l4)
   goals met: 5 of 12
24. (drive t0 l4 l6 level21 level6 level27)
   deleted: (at t0 l4) (fuel t0 level27)
   added: (at t0 l6) (fuel t0 level21)
   goals met: 5 of 12
25. (unload p3 t0 l6)
   deleted: (in p3 t0)
   added: (at p3 l6)
   goals met: 6 of 12
26. (unload p7 t0 l6)
   deleted: (in p7 t0)
   added: (at p7 l6)
   goals met: 7 of 12
27. (drive t0 l6 l3 level9 level12 level21)
   deleted: (at t0 l6) (fuel t0 level21)
   added: (at t0 l3) (fuel t0 level9)
   goals met: 7 of 12
28. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 8 of 12
29. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 9 of 12
30. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 10 of 12
31. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 11 of 12
32. (unload p8 t0 l3)
   deleted: (in p8 t0)
   added: (at p8 l3)
   goals met: 12 of 12
